src/notes/sentence-based-natural-language-plagiarism-detection.org
#+TITLE: Sentence-Based Natural Language Plagiarism Detection
#+DATE: 2005-09-16
#+OPTIONS: toc:nil

This paper details a novel algorithm for comparison of suspect documents at a sentence level and has been implemented as a component of plagiarism detection software for detecting similarities in both natural language documents and comments within program source code.

[[http://doi.acm.org/10.1145/1086339.1086341]]

You might need an ACM login.

It could be useful to implement a plagiarism detection system for conference papers. I remember we used to manually find copied papers on the internet during the Vidyakash 2002/KBCS 2002 conferences.
