docs/notes/sentence-based-natural-language-plagiarism-detection.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!--  -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Sentence-Based Natural Language Plagiarism Detection</title>
<meta name="author" content="Pankaj Jangid" />
<meta name="description" content="A sentence-level algorithm for plagiarism detection across natural language documents and source code comments, implemented as part of a larger plagiarism detection system during my NCST thesis work." />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/css/main.css" />

<link rel="canonical" href="https://jangid.info/notes/sentence-based-natural-language-plagiarism-detection.html"/>
<meta name="description" content="A sentence-level algorithm for plagiarism detection across natural language documents and source code comments, implemented as part of a larger plagiarism detection system during my NCST thesis work."/>
<meta property="og:type" content="article"/>
<meta property="og:site_name" content="Pankaj Jangid"/>
<meta property="og:title" content="Sentence-Based Natural Language Plagiarism Detection"/>
<meta property="og:description" content="A sentence-level algorithm for plagiarism detection across natural language documents and source code comments, implemented as part of a larger plagiarism detection system during my NCST thesis work."/>
<meta property="og:url" content="https://jangid.info/notes/sentence-based-natural-language-plagiarism-detection.html"/>
<meta name="twitter:card" content="summary"/>
<meta name="twitter:site" content="@jangid"/>
<meta name="twitter:title" content="Sentence-Based Natural Language Plagiarism Detection"/>
<meta name="twitter:description" content="A sentence-level algorithm for plagiarism detection across natural language documents and source code comments, implemented as part of a larger plagiarism detection system during my NCST thesis work."/>
<link rel="alternate" type="application/rss+xml" title="Pankaj Jangid — Notes" href="/notes/feed.xml"/>
</head>
<body>
<div id="preamble" class="status">
<nav class="site-nav"><a href="/">Home</a><a href="/notes/">Notes</a></nav>
</div>
<div id="content" class="content">
<p class="eyebrow"><a href="/notes/tags/tech.html">tech</a></p><h1 class="title">Sentence-Based Natural Language Plagiarism Detection</h1><p class="byline">Published 16 Sep 2005</p>
<p>
This paper details a novel algorithm for comparison of suspect documents at a sentence level and has been implemented as a component of plagiarism detection software for detecting similarities in both natural language documents and comments within program source code.
</p>

<p>
<a href="http://doi.acm.org/10.1145/1086339.1086341">http://doi.acm.org/10.1145/1086339.1086341</a>
</p>

<p>
You might need an ACM login.
</p>

<p>
It could be useful to implement a plagiarism detection system for conference papers. I remember we used to manually find copied papers on the internet during the Vidyakash 2002/KBCS 2002 conferences.
</p>
</div>
<div id="postamble" class="status">
<nav class="prev-next"><a class="newer" href="./chicago-downtown-trip.html"><span class="label">Newer</span><span class="title">&larr; Chicago Downtown Trip</span></a><a class="older" href="./cfg-to-parse-roman-numerals.html"><span class="label">Older</span><span class="title">CFG to Parse Roman Numerals &rarr;</span></a></nav><div class="site-footer"><span><a href="mailto:pankaj@jangid.info">pankaj@jangid.info</a></span><span class="sep">·</span><span><a href="https://x.com/jangid" rel="me">X</a></span><span class="sep">·</span><span><a href="https://www.linkedin.com/in/pankaj-jangid/" rel="me">LinkedIn</a></span><span class="sep">·</span><span><a href="https://github.com/jangid" rel="me">GitHub</a></span></div><div class="legal">&copy; 2005&ndash;2026 Pankaj Jangid. Prose licensed under <a href="https://creativecommons.org/licenses/by/4.0/">CC BY 4.0</a>; code snippets under the MIT License.</div>
</div>
</body>
</html>
